ERP DEV.WMS/src/Documents/вмс_ВыборочнаяИнвентаризация/вмс_ВыборочнаяИнвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ВыборочнаяИнвентаризация</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.вмс_СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьТаблицуПустымиЯчейками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/Documents/вмс_ВыборочнаяИнвентаризация/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
	КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.вмс_ЗаданиеКладовщику.ПолноеИмя();
	КомандаСоздатьНаОсновании.Обработчик = "Документы.вмс_ЗаданиеКладовщику.СоздатьЗадачиНаИнвентаризацию";
	КомандаСоздатьНаОсновании.Представление = "Создать задачи на ТСД";
	КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
	
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИтогиИнвентаризации";
	КомандаПечати.Представление = НСтр("ru = 'Результаты пересчета'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИтогиИнвентаризации") Тогда
		Для каждого Объект Из МассивОбъектов Цикл
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ИтогиИнвентаризации", НСтр("ru = 'Результаты пересчета'"), СформироватьПечатнуюФормуИтогиИнвентаризации(Объект, ОбъектыПечати, ПараметрыПечати));	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуИтогиИнвентаризации(Объект, ОбъектыПечати, ПараметрыПечати = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_вмс_ВыборочнаяИнвентаризация_ИтогиИнвентаризации";
	
	Макет = Документы.вмс_ВыборочнаяИнвентаризация.ПолучитьМакет("ИтогиИнвентаризации");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ОблТовар = Макет.ПолучитьОбласть("СтрокаТовар");
	ОблИсполнитель = Макет.ПолучитьОбласть("СтрокаИсполнитель");
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамКлиентСервер.ИспользуемыеТоварныеПоля();
	вмс_РаботаСКоллекциями.ВычестьМассив(ТоварныеПоляМассив, "Товар");
	вмс_РаботаСКоллекциями.ВычестьМассив(ТоварныеПоляМассив, "Характеристика");
	ТоварныеПоля = вмс_РаботаСКоллекциями.МассивВСтроку(ТоварныеПоляМассив);
	
	ТоварныеПоляЗаголовокМассив = вмс_РаботаСКоллекциями.СтрокуВМассив(вмс_РаботаСКоллекциями.МассивВСтроку(ТоварныеПоляМассив));
	ИндексПоискаПоля = ТоварныеПоляЗаголовокМассив.Найти("Партия");
	Если ИндексПоискаПоля <> Неопределено Тогда
		ТоварныеПоляЗаголовокМассив[ИндексПоискаПоля] = "Партия";				
	КонецЕсли;
	ТоварныеПоляЗаголовок = вмс_РаботаСКоллекциями.МассивВСтроку(ТоварныеПоляЗаголовокМассив);
	
	ОблШапка.Параметры.Распоряжение = Строка(Объект.Ссылка);
	ОблШапка.Параметры.ТоварныеПоляЗаголовок = ТоварныеПоляЗаголовок;
	ТабличныйДокумент.Вывести(ОблШапка);
	
	Если Объект.Товары.Количество() > 0 Тогда
		Если ТоварныеПоля = "" Тогда
			ТаблицаТоваров = Объект.Товары.Выгрузить(,"Ячейка, Номенклатура, Характеристика, КоличествоФакт, Количество" + ТоварныеПоля);
			ТаблицаТоваров.Свернуть("Ячейка, Номенклатура, Характеристика", "КоличествоФакт, Количество" + ТоварныеПоля);
		Иначе
			ТаблицаТоваров = Объект.Товары.Выгрузить(,"Ячейка, Номенклатура, Характеристика, КоличествоФакт, Количество, " + ТоварныеПоля);
			ТаблицаТоваров.Свернуть("Ячейка, Номенклатура, Характеристика, " + ТоварныеПоля, "КоличествоФакт, Количество");
		КонецЕсли;
		Для Каждого Строка Из ТаблицаТоваров Цикл 
			
			Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			ОблТовар.Параметры.Ячейка = Строка(Строка.Ячейка);
			ОблТовар.Параметры.Артикул = Строка(Строка.Номенклатура.Артикул);
			ОблТовар.Параметры.Товар = Строка(Строка.Номенклатура) + ?(ЗначениеЗаполнено(Строка.Характеристика), ", " + Строка(Строка.Характеристика), "");
			ОблТовар.Параметры.КоличествоФакт = Формат(Строка.КоличествоФакт, "ЧДЦ=3");
			ОблТовар.Параметры.КоличествоУчет = Формат(Строка.Количество, "ЧДЦ=3");
			
			Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
				ОблТовар.Параметры.ТоварныеПоля = Строка(Строка[ИмяПоля]) + ", ";
			КонецЦикла;
			ОблТовар.Параметры.ТоварныеПоля = Лев(ОблТовар.Параметры.ТоварныеПоля, СтрДлина(ОблТовар.Параметры.ТоварныеПоля) - 2);
			
			ТабличныйДокумент.Вывести(ОблТовар);
		КонецЦикла;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Таблица с товарами пуста. Выберите склад и нажмите кнопку Заполнить таблицу";
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОблПодвал);
	
	
	ТаблицаИсполнителей = Объект.Товары.Выгрузить(,"Исполнитель");
	ТаблицаИсполнителей.Свернуть("Исполнитель");
	Для Каждого Строка Из ТаблицаИсполнителей Цикл
		ОблИсполнитель.Параметры.Исполнитель = Строка(Строка.Исполнитель);
		ТабличныйДокумент.Вывести(ОблИсполнитель);		
	КонецЦикла;
	
	ТабличныйДокумент.ТолькоПросмотр = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Истина;
	ТабличныйДокумент.ОтображатьСетку = Ложь; 
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт
	
	МассивДоступныхПечатныхФорм = Новый Массив;
	
	Возврат МассивДоступныхПечатныхФорм
	
КонецФункции
#КонецЕсли
